{
  "title":"JP Featured Articles",
  "content":"<p><strong>Full Description:</strong><p>Transform your Shopify site into a dynamic content hub with the JP Featured Articles app block. This powerful tool enables you to display featured articles from your blog, inviting visitors to dive deeper into your content. With extensive customization options, you can design the block to fit your site's aesthetics and engage your audience at a glance.<p><strong>How to Use:</strong><ol><li><strong>Select Your Content:</strong> Choose the specific blog from which to<p><strong>Full Description:</strong></p><p>Transform your Shopify site into a dynamic content hub with the JP Featured Articles app block. This powerful tool enables you to display featured articles from your blog, inviting visitors to dive deeper into your content. With extensive customization options, you can design the block to fit your site's aesthetics and engage your audience at a glance.</p><p><strong>How to Use:</strong></p><ol><li><strong>Select Your Content:</strong> Choose the specific blog from which to display articles.</li><li><strong>Customize Display Options:</strong><ul><li><strong>Articles to Show:</strong> Decide on the number of articles to display, anywhere from 2 to 5, to match your layout.</li><li><strong>Visibility Toggles:</strong> Enhance your articles with options to show tags, author names, estimated read time, publication dates, and comment counts.</li><li><strong>Article Excerpts:</strong> Activate to display a snippet of each article, enticing visitors to read more.</li></ul></li><li><strong>Design Your Call to Action:</strong> Customize the Read More button with different styles (primary, secondary, or link-style) to complement your site's theme.</li><li><strong>Adjust Layout and Animation:</strong> Choose between standard or wide layouts and add animations for an interactive visitor experience.</li><li><strong>Final Touches:</strong> Enable features like border display and select your desired animation style for a polished look.</li></ol><p><strong>Why Use JP Featured Articles?</strong> This app block not only enhances your site's visual appeal but also serves as a strategic tool to increase visitor engagement and highlight your thought leadership. With its easy setup and customization, you can create a compelling showcase of your best content, encouraging deeper interaction with your brand.</p>",
  "shortDesc": "Showcase your blog's best with customizable, engaging article highlights right on your store.",
  "videoId": "fezTozTznKs",
  "templates": ["article"],
  "repoData":{
      "repoName":"Flex-Theme-Featured-Articles-Section",
    "sections":["index__featured-articles.liquid"],
    "snippets":[],
    "assets":[]
  }
}
